# Pandas

In [1]:
import pandas as pd

* Series---1D array
* Data frame---2D array (Table format,row & col)

In [2]:
a= pd.Series([])
b= pd.Series([1,2,33,47,58,100])
c= pd.Series((45,89,20,30,44))
d= pd.Series({'a':10,'b':15,'c':56,'d':99})

C:\Users\admin\AppData\Local\Temp\ipykernel_3968\2201563166.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a= pd.Series([])

In [3]:
print(type(a))
print(type(b))
print(type(c))
print(type(d))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0      1
1      2
2     33
3     47
4     58
5    100
dtype: int64

In [6]:
c

0    45
1    89
2    20
3    30
4    44
dtype: int64

In [7]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [11]:
import numpy as np

In [12]:
n= np.array([1,2,3,4,40])

In [14]:
x= pd.Series(n)

In [15]:
x

0     1
1     2
2     3
3     4
4    40
dtype: int32

In [16]:
type(x)

pandas.core.series.Series

In [17]:
b= pd.Series([1,2,[11,10],33,[12,23],47,58,100])

In [18]:
b

0           1
1           2
2    [11, 10]
3          33
4    [12, 23]
5          47
6          58
7         100
dtype: object

In [19]:
type(b)

pandas.core.series.Series

In [20]:
b[0]

1

In [22]:
b[2]

[11, 10]

In [23]:
b[3:7]

3          33
4    [12, 23]
5          47
6          58
dtype: object

In [24]:
d

a    10
b    15
c    56
d    99
dtype: int64

In [25]:
d['b']

15

In [26]:
d['b':'d']

b    15
c    56
d    99
dtype: int64

In [32]:
s= pd.Series([12,52,42,10,23], index=['q','w','e','r','t'])
# or
# s= pd.Series([12,52,42,10,23], index=list('qwert')

In [33]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [35]:
s1= pd.Series([12,12,52,52,42,23,10,23])

In [36]:
s1

0    12
1    12
2    52
3    52
4    42
5    23
6    10
7    23
dtype: int64

In [37]:
s1.value_counts()

12    2
52    2
23    2
42    1
10    1
dtype: int64

In [39]:
np.argmax(s1)

2

In [42]:
s

q    12
w    52
e    42
r    10
t    23
dtype: int64

In [43]:
np.argmax(s)

1

In [48]:
s.idxmax()

'w'

# dataframe

In [50]:
a= pd.DataFrame()
b= pd.DataFrame([1,2,55,40,86])

In [51]:
a

Empty DataFrame
Columns: []
Index: []

In [53]:
type(b)

pandas.core.frame.DataFrame

In [52]:
b

    0
0   1
1   2
2  55
3  40
4  86

In [1]:
c= pd.DataFrame([[1,2,3],[10,20,30],[7,8,9]])

NameError: name 'pd' is not defined

In [55]:
c

    0   1   2
0   1   2   3
1  10  20  30
2   7   8   9

In [56]:
d= pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50],[7,8,9,10,11],[23,34,45,56,67],[9,8,7,6,5]])

In [57]:
d

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
2   7   8   9  10  11
3  23  34  45  56  67
4   9   8   7   6   5

In [63]:
d.head(2)

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50

In [64]:
d.tail(1)

   0  1  2  3  4
4  9  8  7  6  5

In [66]:
d.sample(3)

    0   1   2   3   4
0   1   2   3   4   5
1  10  20  30  40  50
3  23  34  45  56  67

In [70]:
d1= pd.DataFrame([[1,2,3,4],[10,20,30,50,60],[7,8,10,11],[23,45,56,67],[8,7,6,5]])

In [71]:
d1

    0   1   2   3     4
0   1   2   3   4   NaN
1  10  20  30  50  60.0
2   7   8  10  11   NaN
3  23  45  56  67   NaN
4   8   7   6   5   NaN

In [84]:
d1= pd.DataFrame([[1,2,np.nan,4,5],[10,20,4,50,60],[7,8,10,11],[23,45,56,67],[8,7,6,5]],columns=['colA','colB','colC','colD','colE'],index=['a',2,'b',4,'c'])

In [85]:
d1

   colA  colB  colC  colD  colE
a     1     2   NaN     4   5.0
2    10    20   4.0    50  60.0
b     7     8  10.0    11   NaN
4    23    45  56.0    67   NaN
c     8     7   6.0     5   NaN

In [89]:
d1[['colB','colA']]

   colB  colA
a     2     1
2    20    10
b     8     7
4    45    23
c     7     8

In [91]:
d1[['colB','colA']].head(3)

   colB  colA
a     2     1
2    20    10
b     8     7

In [92]:
d1[['colB','colA']][1:4]

   colB  colA
2    20    10
b     8     7
4    45    23

In [94]:
d

    0   1   2   3
0   1   2   3   4
1  10  20  30  50
2   7   8  10  11
3  23  45  56  67
4   8   7   6   5

In [97]:
d1.shape

(5, 5)

In [100]:
d1

   colA  colB  colC  colD  colE
a     1     2   NaN     4   5.0
2    10    20   4.0    50  60.0
b     7     8  10.0    11   NaN
4    23    45  56.0    67   NaN
c     8     7   6.0     5   NaN

In [101]:
d1.max()

colA    23.0
colB    45.0
colC    56.0
colD    67.0
colE    60.0
dtype: float64

In [103]:
d1['colA'].max()

23

In [107]:
d1['New column']= [2,34,5,43,56]

In [110]:
d1['New column2']= [28,34,4,53,9]

In [111]:
d1

   colA  colB  colC  colD  colE  New column  New column2
a     1     2   NaN     4   5.0           2           28
2    10    20   4.0    50  60.0          34           34
b     7     8  10.0    11   NaN           5            4
4    23    45  56.0    67   NaN          43           53
c     8     7   6.0     5   NaN          56            9

In [117]:
d1['colF']=d1['New column']+d1['New column2']

In [118]:
d1

   colA  colB  colC  colD  colE  New column  New column2  colF
a     1     2   NaN     4   5.0           2           28    30
2    10    20   4.0    50  60.0          34           34    68
b     7     8  10.0    11   NaN           5            4     9
4    23    45  56.0    67   NaN          43           53    96
c     8     7   6.0     5   NaN          56            9    65

In [124]:
f= d1['colF']>50

In [125]:
d1[f]

   colA  colB  colC  colD  colE  New column  New column2  colF
2    10    20   4.0    50  60.0          34           34    68
4    23    45  56.0    67   NaN          43           53    96
c     8     7   6.0     5   NaN          56            9    65